backend-final-project/app/controllers/api/v1/auth_controller.rb

  def show
    if decoded_token
      @photographer = Photographer.find(decoded_token[0]['photographer_id'])
---
SELECT  "photographers".* FROM "photographers" WHERE "photographers"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]