backend-final-project/app/controllers/api/v1/auth_controller.rb

  def create
    if params[:user]
      @user = User.find_by(username: user_login_params[:username])
      if @user && @user.authenticate(user_login_params[:password])
        token = encode_token({ user_id: @user.id })
        render json: { user: @user, jwt: token }, status: 202
      else
        render json: { message: "Invalid username or password" }, status: 401
      end
    elsif params[:photographer]
      @photographer = Photographer.find_by(username: photographer_login_params[:username])
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Garry"], ["LIMIT", 1]]
SELECT  "photographers".* FROM "photographers" WHERE "photographers"."username" = $1 LIMIT $2  [["username", "thugnanny"], ["LIMIT", 1]]