backend-final-project/app/controllers/api/v1/packages_controller.rb

SELECT "packages".* FROM "packages"
---
  def index
    @packages = Package.all

SELECT "packages".* FROM "packages" WHERE "packages"."photographer_id" = $1  [["photographer_id", 2]]
SELECT "photos".* FROM "photos" WHERE "photos"."photographer_id" = $1  [["photographer_id", 2]]
---
  def photographer_packages
    @packages = Package.all.select{ |p| p.photographer_id === package_params[:photographer_id] }