backend-final-project/app/controllers/api/v1/photos_controller.rb

SELECT "photos".* FROM "photos"
---
  def index
    @photos = Photo.all