backend-final-project/app/controllers/api/v1/photographers_controller.rb

SELECT "photographers".* FROM "photographers"
---
  def index
    @photographers = Photographer.all

SELECT  "photographers".* FROM "photographers" WHERE "photographers"."custom_url" = $1 LIMIT $2  [["custom_url", "thugnanny"], ["LIMIT", 1]]
---
  def selected_photographer
    @photographer = Photographer.find_by(custom_url: photographer_params[:custom_url][1..-1])

SELECT  "photographers".* FROM "photographers" WHERE "photographers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @photographer = Photographer.find(params[:id])