backend-final-project/app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("username", "first_name", "last_name", "email", "city", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save